Sysbench-0.5/MDEV-13845/RocksDB-Tuning/res09/sysbench.ro.128.res
sysbench 0.5:  multi-threaded system evaluation benchmark

Running the test with following options:
Number of threads: 128
Report intermediate results every 2 second(s)
Initializing random number generator from seed (42).


Threads started!

[   2s] threads: 128, tps: 5586.25, reads: 78664.55, writes: 0.00, response time: 37.15ms (95%), errors: 0.00, reconnects:  0.00
[   4s] threads: 128, tps: 6420.55, reads: 89981.63, writes: 0.00, response time: 28.32ms (95%), errors: 0.00, reconnects:  0.00
[   6s] threads: 128, tps: 5766.49, reads: 80564.42, writes: 0.00, response time: 30.71ms (95%), errors: 0.00, reconnects:  0.00
[   8s] threads: 128, tps: 6260.01, reads: 87656.08, writes: 0.00, response time: 28.46ms (95%), errors: 0.00, reconnects:  0.00
[  10s] threads: 128, tps: 6552.50, reads: 91802.00, writes: 0.00, response time: 28.01ms (95%), errors: 0.00, reconnects:  0.00
[  12s] threads: 128, tps: 5799.00, reads: 81158.48, writes: 0.00, response time: 32.12ms (95%), errors: 0.00, reconnects:  0.00
[  14s] threads: 128, tps: 5533.49, reads: 77460.90, writes: 0.00, response time: 35.63ms (95%), errors: 0.00, reconnects:  0.00
[  16s] threads: 128, tps: 6585.00, reads: 92206.54, writes: 0.00, response time: 28.39ms (95%), errors: 0.00, reconnects:  0.00
[  18s] threads: 128, tps: 5591.99, reads: 78311.34, writes: 0.00, response time: 38.35ms (95%), errors: 0.00, reconnects:  0.00
[  20s] threads: 128, tps: 6273.02, reads: 87936.27, writes: 0.00, response time: 28.27ms (95%), errors: 0.00, reconnects:  0.00
[  22s] threads: 128, tps: 6501.97, reads: 90924.11, writes: 0.00, response time: 28.72ms (95%), errors: 0.00, reconnects:  0.00
[  24s] threads: 128, tps: 6067.53, reads: 84904.39, writes: 0.00, response time: 30.67ms (95%), errors: 0.00, reconnects:  0.00
[  26s] threads: 128, tps: 6247.49, reads: 87453.30, writes: 0.00, response time: 30.32ms (95%), errors: 0.00, reconnects:  0.00
[  28s] threads: 128, tps: 6197.52, reads: 86861.28, writes: 0.00, response time: 28.62ms (95%), errors: 0.00, reconnects:  0.00
[  30s] threads: 128, tps: 6378.48, reads: 89266.79, writes: 0.00, response time: 29.43ms (95%), errors: 0.00, reconnects:  0.00
[  32s] threads: 128, tps: 6537.01, reads: 91513.67, writes: 0.00, response time: 28.02ms (95%), errors: 0.00, reconnects:  0.00
[  34s] threads: 128, tps: 6235.50, reads: 87342.54, writes: 0.00, response time: 29.77ms (95%), errors: 0.00, reconnects:  0.00
[  36s] threads: 128, tps: 6041.99, reads: 84491.84, writes: 0.00, response time: 30.33ms (95%), errors: 0.00, reconnects:  0.00
[  38s] threads: 128, tps: 7279.50, reads: 101958.52, writes: 0.00, response time: 25.39ms (95%), errors: 0.00, reconnects:  0.00
[  40s] threads: 128, tps: 7278.51, reads: 101849.09, writes: 0.00, response time: 26.07ms (95%), errors: 0.00, reconnects:  0.00
[  42s] threads: 128, tps: 6953.50, reads: 97449.47, writes: 0.00, response time: 26.88ms (95%), errors: 0.00, reconnects:  0.00
[  44s] threads: 128, tps: 6829.00, reads: 95491.00, writes: 0.00, response time: 28.32ms (95%), errors: 0.00, reconnects:  0.00
[  46s] threads: 128, tps: 6998.98, reads: 98002.27, writes: 0.00, response time: 26.55ms (95%), errors: 0.00, reconnects:  0.00
[  48s] threads: 128, tps: 6910.52, reads: 96843.76, writes: 0.00, response time: 27.66ms (95%), errors: 0.00, reconnects:  0.00
[  50s] threads: 128, tps: 7120.00, reads: 99639.04, writes: 0.00, response time: 26.50ms (95%), errors: 0.00, reconnects:  0.00
[  52s] threads: 128, tps: 7032.50, reads: 98487.52, writes: 0.00, response time: 26.62ms (95%), errors: 0.00, reconnects:  0.00
[  54s] threads: 128, tps: 7194.94, reads: 100681.66, writes: 0.00, response time: 26.28ms (95%), errors: 0.00, reconnects:  0.00
[  56s] threads: 128, tps: 7003.55, reads: 98068.25, writes: 0.00, response time: 27.12ms (95%), errors: 0.00, reconnects:  0.00
[  58s] threads: 128, tps: 6979.49, reads: 97679.32, writes: 0.00, response time: 26.86ms (95%), errors: 0.00, reconnects:  0.00
[  60s] threads: 128, tps: 6980.02, reads: 97739.84, writes: 0.00, response time: 27.06ms (95%), errors: 0.00, reconnects:  0.00
OLTP test statistics:
    queries performed:
        read:                            5565196
        write:                           0
        other:                           795028
        total:                           6360224
    transactions:                        397514 (6514.36 per sec.)
    read/write requests:                 5565196 (91201.04 per sec.)
    other operations:                    795028 (13028.72 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          61.0212s
    total number of events:              397514
    total time taken by event execution: 7808.8948s
    response time:
         min:                                  6.81ms
         avg:                                 19.64ms
         max:                                255.44ms
         approx.  95 percentile:              28.36ms

Threads fairness:
    events (avg/stddev):           3105.5781/18.95
    execution time (avg/stddev):   61.0070/0.01